## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * google_container_node_pool.components_pool
  * google_container_node_pool.prowjobs_pool
* Delete
  * google_container_node_pool.general_trusted
  * google_container_node_pool.preemptible_standard_pool



<details><summary>Change Result (Click me)</summary>

```hcl

  # google_container_node_pool.components_pool will be created
  + resource "google_container_node_pool" "components_pool" {
      + cluster                     = "projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = (known after apply)
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "components-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = "ANY"
          + max_node_count  = 2
          + min_node_count  = 1
        }

      + management {
          + auto_repair  = (known after apply)
          + auto_upgrade = (known after apply)
        }

      + network_config {
          + create_pod_range     = (known after apply)
          + enable_private_nodes = (known after apply)
          + pod_ipv4_cidr_block  = (known after apply)
          + pod_range            = (known after apply)

          + pod_cidr_overprovision_config {
              + disabled = (known after apply)
            }
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "workload" = "components"
            }
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "e2-medium"
          + metadata          = {
              + "disable-legacy-endpoints" = "true"
            }
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = true
          + service_account   = (known after apply)
          + spot              = false
          + taint             = [
              + {
                  + effect = "NO_SCHEDULE"
                  + key    = "components.gke.io/gke-managed-components"
                  + value  = ""
                },
            ]

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
          + strategy        = (known after apply)

          + blue_green_settings {
              + node_pool_soak_duration = (known after apply)

              + standard_rollout_policy {
                  + batch_node_count    = (known after apply)
                  + batch_percentage    = (known after apply)
                  + batch_soak_duration = (known after apply)
                }
            }
        }
    }

  # google_container_node_pool.general_trusted will be destroyed
  # (because google_container_node_pool.general_trusted is not in configuration)
  - resource "google_container_node_pool" "general_trusted" {
      - cluster                     = "projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow" -> null
      - id                          = "projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow/nodePools/general-pool" -> null
      - initial_node_count          = 1 -> null
      - instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/sap-kyma-prow/zones/europe-west4-a/instanceGroupManagers/gke-trusted-workload-kym-general-pool-e7cfffa6-grp",
          - "https://www.googleapis.com/compute/v1/projects/sap-kyma-prow/zones/europe-west4-c/instanceGroupManagers/gke-trusted-workload-kym-general-pool-8115cccc-grp",
          - "https://www.googleapis.com/compute/v1/projects/sap-kyma-prow/zones/europe-west4-b/instanceGroupManagers/gke-trusted-workload-kym-general-pool-b0faccc3-grp",
        ] -> null
      - location                    = "europe-west4" -> null
      - managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/sap-kyma-prow/zones/europe-west4-a/instanceGroups/gke-trusted-workload-kym-general-pool-e7cfffa6-grp",
          - "https://www.googleapis.com/compute/v1/projects/sap-kyma-prow/zones/europe-west4-c/instanceGroups/gke-trusted-workload-kym-general-pool-8115cccc-grp",
          - "https://www.googleapis.com/compute/v1/projects/sap-kyma-prow/zones/europe-west4-b/instanceGroups/gke-trusted-workload-kym-general-pool-b0faccc3-grp",
        ] -> null
      - name                        = "general-pool" -> null
      - node_count                  = 1 -> null
      - node_locations              = [
          - "europe-west4-a",
          - "europe-west4-b",
          - "europe-west4-c",
        ] -> null
      - project                     = "sap-kyma-prow" -> null
      - version                     = "1.26.5-gke.1200" -> null

      - management {
          - auto_repair  = true -> null
          - auto_upgrade = true -> null
        }

      - network_config {
          - create_pod_range     = false -> null
          - enable_private_nodes = false -> null
        }

      - node_config {
          - disk_size_gb      = 100 -> null
          - disk_type         = "pd-balanced" -> null
          - guest_accelerator = [] -> null
          - image_type        = "COS_CONTAINERD" -> null
          - labels            = {
              - "workload" = "general-purpose"
            } -> null
          - local_ssd_count   = 0 -> null
          - logging_variant   = "DEFAULT" -> null
          - machine_type      = "e2-medium" -> null
          - metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> null
          - oauth_scopes      = [
              - "https://www.googleapis.com/auth/devstorage.read_only",
              - "https://www.googleapis.com/auth/logging.write",
              - "https://www.googleapis.com/auth/monitoring",
              - "https://www.googleapis.com/auth/service.management.readonly",
              - "https://www.googleapis.com/auth/servicecontrol",
              - "https://www.googleapis.com/auth/trace.append",
            ] -> null
          - preemptible       = true -> null
          - resource_labels   = {} -> null
          - service_account   = "default" -> null
          - spot              = false -> null
          - tags              = [] -> null
          - taint             = [] -> null

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }

          - workload_metadata_config {
              - mode = "GKE_METADATA" -> null
            }
        }

      - upgrade_settings {
          - max_surge       = 1 -> null
          - max_unavailable = 0 -> null
          - strategy        = "SURGE" -> null
        }
    }

  # google_container_node_pool.preemptible_standard_pool will be destroyed
  # (because google_container_node_pool.preemptible_standard_pool is not in configuration)
  - resource "google_container_node_pool" "preemptible_standard_pool" {
      - cluster                     = "projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow" -> null
      - id                          = "projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow/nodePools/standard-pool" -> null
      - initial_node_count          = 0 -> null
      - instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/sap-kyma-prow/zones/europe-west4-a/instanceGroupManagers/gke-trusted-workload-ky-standard-pool-6f619fac-grp",
          - "https://www.googleapis.com/compute/v1/projects/sap-kyma-prow/zones/europe-west4-c/instanceGroupManagers/gke-trusted-workload-ky-standard-pool-7aa59aa4-grp",
          - "https://www.googleapis.com/compute/v1/projects/sap-kyma-prow/zones/europe-west4-b/instanceGroupManagers/gke-trusted-workload-ky-standard-pool-d4bd1119-grp",
        ] -> null
      - location                    = "europe-west4" -> null
      - managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/sap-kyma-prow/zones/europe-west4-a/instanceGroups/gke-trusted-workload-ky-standard-pool-6f619fac-grp",
          - "https://www.googleapis.com/compute/v1/projects/sap-kyma-prow/zones/europe-west4-c/instanceGroups/gke-trusted-workload-ky-standard-pool-7aa59aa4-grp",
          - "https://www.googleapis.com/compute/v1/projects/sap-kyma-prow/zones/europe-west4-b/instanceGroups/gke-trusted-workload-ky-standard-pool-d4bd1119-grp",
        ] -> null
      - name                        = "standard-pool" -> null
      - node_count                  = 0 -> null
      - node_locations              = [
          - "europe-west4-a",
          - "europe-west4-b",
          - "europe-west4-c",
        ] -> null
      - project                     = "sap-kyma-prow" -> null
      - version                     = "1.26.5-gke.1200" -> null

      - autoscaling {
          - location_policy      = "ANY" -> null
          - max_node_count       = 16 -> null
          - min_node_count       = 0 -> null
          - total_max_node_count = 0 -> null
          - total_min_node_count = 0 -> null
        }

      - management {
          - auto_repair  = true -> null
          - auto_upgrade = true -> null
        }

      - network_config {
          - create_pod_range     = false -> null
          - enable_private_nodes = false -> null
        }

      - node_config {
          - disk_size_gb      = 200 -> null
          - disk_type         = "pd-balanced" -> null
          - guest_accelerator = [] -> null
          - image_type        = "COS_CONTAINERD" -> null
          - labels            = {
              - "workload" = "prow-jobs"
            } -> null
          - local_ssd_count   = 0 -> null
          - logging_variant   = "DEFAULT" -> null
          - machine_type      = "n2d-standard-8" -> null
          - metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> null
          - oauth_scopes      = [
              - "https://www.googleapis.com/auth/devstorage.read_only",
              - "https://www.googleapis.com/auth/logging.write",
              - "https://www.googleapis.com/auth/monitoring",
              - "https://www.googleapis.com/auth/service.management.readonly",
              - "https://www.googleapis.com/auth/servicecontrol",
              - "https://www.googleapis.com/auth/trace.append",
            ] -> null
          - preemptible       = true -> null
          - resource_labels   = {} -> null
          - service_account   = "default" -> null
          - spot              = false -> null
          - tags              = [] -> null
          - taint             = [] -> null

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }

          - workload_metadata_config {
              - mode = "GKE_METADATA" -> null
            }
        }

      - upgrade_settings {
          - max_surge       = 1 -> null
          - max_unavailable = 0 -> null
          - strategy        = "SURGE" -> null
        }
    }

  # google_container_node_pool.prowjobs_pool will be created
  + resource "google_container_node_pool" "prowjobs_pool" {
      + cluster                     = "projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = (known after apply)
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "prowjobs-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = "ANY"
          + max_node_count  = 16
          + min_node_count  = 0
        }

      + management {
          + auto_repair  = (known after apply)
          + auto_upgrade = (known after apply)
        }

      + network_config {
          + create_pod_range     = (known after apply)
          + enable_private_nodes = (known after apply)
          + pod_ipv4_cidr_block  = (known after apply)
          + pod_range            = (known after apply)

          + pod_cidr_overprovision_config {
              + disabled = (known after apply)
            }
        }

      + node_config {
          + disk_size_gb      = 200
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "workload" = "prowjobs"
            }
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "n2d-standard-8"
          + metadata          = {
              + "disable-legacy-endpoints" = "true"
            }
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = true
          + service_account   = (known after apply)
          + spot              = false
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
          + strategy        = (known after apply)

          + blue_green_settings {
              + node_pool_soak_duration = (known after apply)

              + standard_rollout_policy {
                  + batch_node_count    = (known after apply)
                  + batch_percentage    = (known after apply)
                  + batch_soak_duration = (known after apply)
                }
            }
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

</details>





## :warning: Warnings :warning:

```hcl
Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

  with kubernetes_service_account.trusted_workload_terraform_executor,
  on terraform-executor.tf line 42, in resource "kubernetes_service_account" "trusted_workload_terraform_executor":
  42: resource "kubernetes_service_account" "trusted_workload_terraform_executor" {

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

(and one more similar warning elsewhere)

```






<!-- github-comment: {"Command":"plan","PRNumber":8220,"Program":"tfcmt","SHA1":"1130ac25c9aa8ff7f0ae43508cf61ff4a7c115f8","Vars":{}} -->